# В купейном вагоне имеется 9 купе с четырьмя местами для пассажиров в каждом. Напишите программу, которая определяет номер купе, в котором находится место с заданным номером (нумерация мест сквозная, начинается с 1).

# На вход программе подаётся целое число – место с заданным номером в вагоне.
# Программа должна вывести одно число – номер купе, в котором находится указанное место.

import math

SEATS_PER_KUPE = 4

seat_number = int(input("Какой у вас место?: "))

kupe_number = math.ceil(seat_number/SEATS_PER_KUPE)

print(f"Место {seat_number} находится в купе с номеров {kupe_number}")
