# На плоскости евклидово расстояние ρ между двумя точками (x1;y1) и (x2;y2) 
# определяется так: 

# Напишите программу, определяющую евклидово расстояние между двумя точками, координаты которых заданы.
# На вход программе подаются четыре действительных числа, каждое на отдельной строке – x1,y1,x2,y2​.
# Программа должна вывести одно число – евклидово расстояние.


import math

def dist(x1, x2, y1, y2):
    return math.sqrt((x1-x2)**2 + (y1-y2)**2)

x1, y1 = map(float, input("Введите координаты первой точки (x y)").split())
x2, y2 = map(float, input("Введите координаты первой точки (x y)").split())

distance = dist(x1, x2, y1, y2)

print(f"Растояние между точками: {distance:.2f}")